src/Documents/АктСписанияЕГАИС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Document>
		<Properties>
			<Name>АктСписанияЕГАИС</Name>
			<BasedOn>
				<xr:Item>Document.СписаниеТоваров</xr:Item>
				<xr:Item>Document.Инвентаризация</xr:Item>
				<xr:Item>Document.ИнвентаризацияАлкогольнойПродукцииЕГАИС</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ОстаткиМарокЕГАИС</xr:Item>
				<xr:Item>AccumulationRegister.ОстаткиАлкогольнойПродукцииЕГАИС</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ОрганизацияЕГАИС</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторОрганизацийЕГАИС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Идентификатор</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПричинаСписания</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПричиныСписанияЕГАИС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РегистрационныйНомер</Name>
					<Comment>Регистрационный номер акта постановки на баланс</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаРегистрации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Comment>Документ, на основании которого введен данный</Comment>
					<Type>
						<v8:Type>cfg:DocumentRef.СписаниеТоваров</v8:Type>
						<v8:Type>cfg:DocumentRef.ИнвентаризацияАлкогольнойПродукцииЕГАИС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Comment>Номенклатура (товар, услуга и т.п.)</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УдалитьЕдиницаИзмерения</Name>
							<Comment>Единица измерения номенклатурной позиции</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.ЕдиницыИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоПоНакладной</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>12</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УдалитьКоэффициент</Name>
							<Comment>Коэффициент пересчета по отношению к базовой единице номенклатуры</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АлкогольнаяПродукция</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КлассификаторАлкогольнойПродукцииЕГАИС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>12</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ХарактеристикаНоменклатуры</Name>
							<Comment>Характеристика/серия номенклатуры</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИдентификаторСтроки</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Справка2</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Справки2ЕГАИС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЦенаРозничная</Name>
							<Comment>Розничная цена для переоценки остатков перед списанием</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаРозничная</Name>
							<Comment>Розничная сумма</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Марки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>КодМарки</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>255</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИдентификаторСтроки</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Смены</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Смена</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ЗакрытиеСмены</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/InformationRegisters/СоответствиеНоменклатурыЕГАИС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>СоответствиеНоменклатурыЕГАИС</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Характеристика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЕдиницаИзмерения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>АлкогольнаяПродукция</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторАлкогольнойПродукцииЕГАИС</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИдентификаторУпаковки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/AccumulationRegisters/ОстаткиАлкогольнойПродукцииЕГАИС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<AccumulationRegister>
		<Properties>
			<Name>ОстаткиАлкогольнойПродукцииЕГАИС</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ХозОперация</Name>
					<Comment>Хозяйственная операция</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ХозОперации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ОрганизацияЕГАИС</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторОрганизацийЕГАИС</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>АлкогольнаяПродукция</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторАлкогольнойПродукцииЕГАИС</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Справка2</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Справки2ЕГАИС</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НомерРегистра</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

src/AccumulationRegisters/ОстаткиМарокЕГАИС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<AccumulationRegister>
		<Properties>
			<Name>ОстаткиМарокЕГАИС</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ХозОперация</Name>
					<Comment>Хозяйственная операция</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ХозОперации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>КодМарки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОрганизацияЕГАИС</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторОрганизацийЕГАИС</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Справка2</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Справки2ЕГАИС</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

src/InformationRegisters/СтатусыДокументовЕГАИС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>СтатусыДокументовЕГАИС</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СтатусОбработки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатусыОбработкиЕГАИС</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВидСтатуса</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыСтатусовОбработкиЕГАИС</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДальнейшееДействие1</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ДальнейшиеДействияЕГАИС</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДальнейшееДействие2</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ДальнейшиеДействияЕГАИС</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДальнейшееДействие3</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ДальнейшиеДействияЕГАИС</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КвитанцияДоставлена</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КвитанцияВыполнена</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УведомлениеОРегистрацииДвижения</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Документ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ТоварноТранспортнаяНакладнаяВходящаяЕГАИС</v8:Type>
						<v8:Type>cfg:DocumentRef.ДобавлениеАлкоподукцииЕГАИС</v8:Type>
						<v8:Type>cfg:DocumentRef.ПеремещениеВТорговыйЗалЕГАИС</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтчетОбИмпортеПродукцииЕГАИС</v8:Type>
						<v8:Type>cfg:DocumentRef.ДобавлениеОрганизацииЕГАИС</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтчетЕГАИС</v8:Type>
						<v8:Type>cfg:DocumentRef.АктСписанияЕГАИС</v8:Type>
						<v8:Type>cfg:DocumentRef.ЧекЕГАИС</v8:Type>
						<v8:Type>cfg:DocumentRef.ТоварноТранспортнаяНакладнаяИсходящаяЕГАИС</v8:Type>
						<v8:Type>cfg:DocumentRef.АктПостановкиНаБалансЕГАИС</v8:Type>
						<v8:Type>cfg:DocumentRef.АктПривязкиМарокЕГАИС</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗакрытиеСмены</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗапросМарокЕГАИС</v8:Type>
						<v8:Type>cfg:DocumentRef.ИнвентаризацияАлкогольнойПродукцииЕГАИС</v8:Type>
						<v8:Type>cfg:DocumentRef.ПроверкаОстатковМарокВЕГАИС</v8:Type>
						<v8:Type>cfg:DocumentRef.ОстаткиЕГАИС</v8:Type>
						<v8:Type>cfg:DocumentRef.ОстаткиМарокЕГАИС</v8:Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеТоваров</v8:Type>
						<v8:Type>cfg:DocumentRef.ФормированиеГрупповойТарыЕГАИС</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/Enums/ПричиныСписанияЕГАИС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>ПричиныСписанияЕГАИС</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Пересортица</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Недостача</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Уценка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Порча</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Потери</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Проверки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Арест</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИныеЦели</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Реализация</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПроизводственныеПотери</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Documents/АктСписанияЕГАИС/Ext/ObjectModule.bsl
// Модуль объекта документа "Акт списания ЕГАИС"

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда


////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

Процедура ЗаполнитьАктСписанияПоИнвентаризации(ДанныеЗаполнения)
	
	Товары.Очистить();
	Марки.Очистить();
	
	ХозОперация     = Справочники.ХозОперации.АктСписанияСТорговогоЗалаЕГАИС;
	ПричинаСписания = Перечисления.ПричиныСписанияЕГАИС.Недостача;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	МИНИМУМ(ВложенныйЗапрос.НомерСтроки) КАК НомерСтроки,
	|	СУММА(ВложенныйЗапрос.Количество) КАК Количество,
	|	ВложенныйЗапрос.Номенклатура КАК Номенклатура,
	|	ВложенныйЗапрос.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|	ВложенныйЗапрос.АлкогольнаяПродукция КАК АлкогольнаяПродукция
	|ИЗ
	|	(ВЫБРАТЬ
	|		МИНИМУМ(ИнвентаризацияТовары.НомерСтроки) КАК НомерСтроки,
	//|	СУММА(ВЫБОР
	//|			КОГДА ИнвентаризацияТовары.АлкогольнаяПродукция.Упакована
	//|				ТОГДА ИнвентаризацияТовары.КоличествоФакт - ИнвентаризацияТовары.КоличествоКнижн
	//|			ИНАЧЕ ИнвентаризацияТовары.КоличествоФакт - ИнвентаризацияТовары.КоличествоКнижн * 10
	//|		КОНЕЦ) КАК Количество,
	|		СУММА(ИнвентаризацияТовары.КоличествоКнижн - ИнвентаризацияТовары.КоличествоФакт) КАК Количество,
	|		ИнвентаризацияТовары.Номенклатура КАК Номенклатура,
	|		ИнвентаризацияТовары.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|		ИнвентаризацияТовары.АлкогольнаяПродукция КАК АлкогольнаяПродукция
	|	ИЗ
	|		Документ.ИнвентаризацияАлкогольнойПродукцииЕГАИС.Товары КАК ИнвентаризацияТовары
	|	ГДЕ
	|		ИнвентаризацияТовары.Ссылка = &Ссылка
	|		И (НЕ ИнвентаризацияТовары.АлкогольнаяПродукция = ЗНАЧЕНИЕ(Справочник.КлассификаторАлкогольнойПродукцииЕГАИС.ПустаяСсылка))
	|		И ИнвентаризацияТовары.Справка2 = ЗНАЧЕНИЕ(Справочник.Справки2ЕГАИС.ПустаяСсылка)
	|	СГРУППИРОВАТЬ ПО
	|		ИнвентаризацияТовары.Номенклатура,
	|		ИнвентаризацияТовары.ХарактеристикаНоменклатуры,
	|		ИнвентаризацияТовары.АлкогольнаяПродукция
	|
	|	ОБЪЕДИНИТЬ ВСЕ
	|
	|	ВЫБРАТЬ
	|		МИНИМУМ(ИнвентаризацияТовары.НомерСтроки) КАК НомерСтроки,
	|		КОЛИЧЕСТВО(ИнвентаризацияАлкогольнойПродукцииЕГАИСМарки.КодМарки) КАК Количество,
	|		ИнвентаризацияТовары.Номенклатура КАК Номенклатура,
	|		ИнвентаризацияТовары.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|		ИнвентаризацияТовары.АлкогольнаяПродукция КАК АлкогольнаяПродукция
	|	ИЗ
	|		Документ.ИнвентаризацияАлкогольнойПродукцииЕГАИС.Товары КАК ИнвентаризацияТовары
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		Документ.ИнвентаризацияАлкогольнойПродукцииЕГАИС.Марки КАК ИнвентаризацияАлкогольнойПродукцииЕГАИСМарки
	|	ПО
	|		ИнвентаризацияТовары.Справка2 = ЗНАЧЕНИЕ(Справочник.Справки2ЕГАИС.ПустаяСсылка) И 
	|		ИнвентаризацияТовары.Ссылка = &Ссылка И 
	|		ИнвентаризацияАлкогольнойПродукцииЕГАИСМарки.Ссылка = &Ссылка И 
	|		ИнвентаризацияТовары.ИдентификаторСтроки = ИнвентаризацияАлкогольнойПродукцииЕГАИСМарки.ИдентификаторСтроки И 
	|		(НЕ ВЫРАЗИТЬ(ИнвентаризацияАлкогольнойПродукцииЕГАИСМарки.КодМарки КАК Строка(68)) = ИнвентаризацияАлкогольнойПродукцииЕГАИСМарки.КодМарки)
	|	ГДЕ
	|		ИнвентаризацияТовары.Ссылка = &Ссылка И 
	|		ИнвентаризацияТовары.Справка2 = ЗНАЧЕНИЕ(Справочник.Справки2ЕГАИС.ПустаяСсылка) И 
	|		ИнвентаризацияАлкогольнойПродукцииЕГАИСМарки.Ссылка = &Ссылка И 
	|		(НЕ ИнвентаризацияТовары.АлкогольнаяПродукция = ЗНАЧЕНИЕ(Справочник.КлассификаторАлкогольнойПродукцииЕГАИС.ПустаяСсылка))
	|	СГРУППИРОВАТЬ ПО
	|		ИнвентаризацияТовары.Номенклатура,
	|		ИнвентаризацияТовары.ХарактеристикаНоменклатуры,
	|		ИнвентаризацияТовары.АлкогольнаяПродукция
	|	ИМЕЮЩИЕ
	|		КОЛИЧЕСТВО(ИнвентаризацияАлкогольнойПродукцииЕГАИСМарки.КодМарки)>0) КАК ВложенныйЗапрос
	|СГРУППИРОВАТЬ ПО
	|	ВложенныйЗапрос.Номенклатура,
	|	ВложенныйЗапрос.ХарактеристикаНоменклатуры,
	|	ВложенныйЗапрос.АлкогольнаяПродукция
	|ИМЕЮЩИЕ
	|	СУММА(ВложенныйЗапрос.Количество) > 0
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтроки
	|";
	
	Запрос.УстановитьПараметр("Ссылка", ДанныеЗаполнения);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		НоваяСтрока = Товары.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
	КонецЦикла;
	
КонецПроцедуры


////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ЗАПОЛНЕНИЯ ОБЪЕКТА

// Производит заполнение объекта на основании документа "Акт списания ЕГАИС"
//
// Параметры:
//  ДанныеЗаполнения     - Произвольный - Значение, которое используется как основание для заполнения.
//  ТекстЗаполнения      - Строка       - Текст, используемый для заполнения объекта.
//  СтандартнаяОбработка - Булево       - В данный параметр передается признак выполнения системной обработки события.
//
Функция ОбработкаЗаполнения_СписаниеТоваров(ДанныеЗаполнения, ТекстЗаполнения="", СтандартнаяОбработка=ИСТИНА) Экспорт
	
	// Если данные заполнения не указаны, значит производиться проверка существования обработчика заполнения у объекта.
	Если НЕ ЗначениеЗаполнено(ДанныеЗаполнения) Тогда
		Возврат ИСТИНА;
	КонецЕсли;
	
	// Вызываем общий обработчик заполнения
	Если НЕ ОбработкаСобытийДокументаСервер.ОбработкаЗаполненияНаОсновании(ЭтотОбъект, ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка) Тогда
		Возврат ИСТИНА;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	СписаниеТоваров.СкладКомпании.ПодразделениеКомпании.Организация КАК Организация,
	|	СписаниеТоваров.СкладКомпании.ПодразделениеКомпании КАК ПодразделениеКомпании,
	|	СписаниеТоваров.СкладКомпании.ПодразделениеКомпании.Организация.ИНН КАК ПодразделениеИНН,
	|	ВЫБОР
	|		КОГДА СписаниеТоваров.СкладКомпании.ПодразделениеКомпании.КПП = """" ТОГДА
	|			СписаниеТоваров.СкладКомпании.ПодразделениеКомпании.Организация.КПП
	|		ИНАЧЕ
	|			СписаниеТоваров.СкладКомпании.ПодразделениеКомпании.КПП
	|	КОНЕЦ КАК ПодразделениеКПП,
	|	СписаниеТоваров.Комментарий КАК Комментарий
	|ИЗ
	|	Документ.СписаниеТоваров КАК СписаниеТоваров
	|ГДЕ
	|	СписаниеТоваров.Ссылка = &Ссылка
	|";
	
	Запрос.УстановитьПараметр("Ссылка", ДанныеЗаполнения);
	
	ВыборкаШапка = Запрос.Выполнить().Выбрать();
	Если НЕ ВыборкаШапка.Следующий() Тогда
		Возврат ИСТИНА;
	КонецЕсли;
	
	ДокументОснование = ДанныеЗаполнения;
	СТорговогоЗала = (ХозОперация = Справочники.ХозОперации.АктСписанияСТорговогоЗалаЕГАИС);
	//Если СТорговогоЗала Тогда
	//	ХозОперация = Справочники.ХозОперации.АктСписанияСТорговогоЗалаЕГАИС;
	//Иначе
	//	ХозОперация = Справочники.ХозОперации.АктСписанияЕГАИС;
	//КонецЕсли;
	Комментарий      = ВыборкаШапка.Комментарий;
	ОрганизацияЕГАИС = Справочники.КлассификаторОрганизацийЕГАИС.НайтиКлассификаторОрганизации(ВыборкаШапка.Организация, ВыборкаШапка.ПодразделениеКомпании, ВыборкаШапка.ПодразделениеИНН, ВыборкаШапка.ПодразделениеКПП);
	
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	СписаниеТоваров.Номенклатура КАК Номенклатура,
	|	СписаниеТоваров.ХарактеристикаНоменклатуры,
	//|	СписаниеТоваров.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	//|	СписаниеТоваров.Коэффициент КАК Коэффициент,
	|	МИНИМУМ(СписаниеТоваров.НомерСтроки) КАК НомерСтроки,
	|	СУММА(СписаниеТоваров.СуммаРозничная) КАК СуммаРозничная,
	|	СУММА(СписаниеТоваров.Количество * СписаниеТоваров.Коэффициент) КАК Количество
	|ПОМЕСТИТЬ
	|	ТаблицаСписания
	|ИЗ
	|	Документ.СписаниеТоваров.Товары КАК СписаниеТоваров
	|ГДЕ
	|	СписаниеТоваров.Ссылка = &Ссылка
	|СГРУППИРОВАТЬ ПО
	|	СписаниеТоваров.Номенклатура,
	|	СписаниеТоваров.ХарактеристикаНоменклатуры
	|;
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ТаблицаСписания.Номенклатура КАК Номенклатура,
	|	СоответствиеНоменклатурыЕГАИС.АлкогольнаяПродукция КАК АлкогольнаяПродукция
	|ПОМЕСТИТЬ
	|	ТаблицаСписанияСопоставлено
	|ИЗ
	|	ТаблицаСписания КАК ТаблицаСписания
	|ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|	РегистрСведений.СоответствиеНоменклатурыЕГАИС КАК СоответствиеНоменклатурыЕГАИС
	|ПО
	|	ТаблицаСписания.Номенклатура = СоответствиеНоменклатурыЕГАИС.Номенклатура
	|;
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	&ОрганизацияЕГАИС КАК ОрганизацияЕГАИС,
	|	СписаниеАлкоголя.АлкогольнаяПродукция КАК АлкогольнаяПродукция
	|ПОМЕСТИТЬ
	|	ОтборАП
	|ИЗ
	|	ТаблицаСписанияСопоставлено КАК СписаниеАлкоголя
	|;
	|
	|ВЫБРАТЬ
	|	СписаниеТоваров.АлкогольнаяПродукция КАК АлкогольнаяПродукция,
	|	СписаниеТоваров.Номенклатура КАК Номенклатура
	|ИЗ
	|	ТаблицаСписанияСопоставлено КАК СписаниеТоваров
	|;
	|
	|ВЫБРАТЬ
	|	ОстаткиАлкогольнойПродукцииЕГАИС.АлкогольнаяПродукция КАК АлкогольнаяПродукция,
	|	ОстаткиАлкогольнойПродукцииЕГАИС.Справка2 КАК Справка2,
	|	ОстаткиАлкогольнойПродукцииЕГАИС.КоличествоОстаток КАК Количество
	//|	ВЫБОР
	//|		КОГДА ОстаткиАлкогольнойПродукцииЕГАИС.АлкогольнаяПродукция.Упакована ТОГДА
	//|			ОстаткиАлкогольнойПродукцииЕГАИС.КоличествоОстаток
	//|		ИНАЧЕ
	//|			ОстаткиАлкогольнойПродукцииЕГАИС.КоличествоОстаток*10
	//|	КОНЕЦ КАК Количество
	|ИЗ
	|	РегистрНакопления.ОстаткиАлкогольнойПродукцииЕГАИС.Остатки(
	|			,
	|			(ОрганизацияЕГАИС, АлкогольнаяПродукция) В
	|					(ВЫБРАТЬ
	|						ОтборАП.ОрганизацияЕГАИС,
	|						ОтборАП.АлкогольнаяПродукция
	|					ИЗ
	|						ОтборАП)
	|				И " + ?(СТорговогоЗала, "Справка2 = ЗНАЧЕНИЕ(Справочник.Справки2ЕГАИС.ПустаяСсылка)", "(НЕ Справка2 = ЗНАЧЕНИЕ(Справочник.Справки2ЕГАИС.ПустаяСсылка))")+") КАК ОстаткиАлкогольнойПродукцииЕГАИС
	|;
	|
	|ВЫБРАТЬ
	|	СписаниеТоваров.Номенклатура КАК Номенклатура,
	|	СписаниеТоваров.ХарактеристикаНоменклатуры,
	|	СписаниеТоваров.НомерСтроки КАК НомерСтроки,
	|	СписаниеТоваров.СуммаРозничная КАК СуммаРозничная,
	|	СписаниеТоваров.Количество КАК КоличествоПоНакладной,
	|	ВЫБОР
	|		КОГДА СписаниеТоваров.Номенклатура.КоличествоВМультипаке = 0 ИЛИ СписаниеТоваров.Номенклатура.КоличествоВМультипаке ЕСТЬ NULL ТОГДА
	|			1
	|		ИНАЧЕ
	|			СписаниеТоваров.Номенклатура.КоличествоВМультипаке
	|	КОНЕЦ КАК КоличествоВМультипаке,
	|	ВЫБОР
	|		КОГДА СписаниеТоваров.Номенклатура.КоличествоВМультипаке = 0 ИЛИ СписаниеТоваров.Номенклатура.КоличествоВМультипаке ЕСТЬ NULL ТОГДА
	|			СписаниеТоваров.Количество
	|		ИНАЧЕ
	|			СписаниеТоваров.Количество*СписаниеТоваров.Номенклатура.КоличествоВМультипаке
	|	КОНЕЦ КАК Количество
	|ИЗ
	|	ТаблицаСписания КАК СписаниеТоваров
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтроки
	|";
	
	Запрос.УстановитьПараметр("Ссылка",           ДанныеЗаполнения);
	Запрос.УстановитьПараметр("ОрганизацияЕГАИС", ОрганизацияЕГАИС);
	
	ПакетЗапросов = Запрос.ВыполнитьПакет();
	
	Сопоставление  = ПакетЗапросов[ПакетЗапросов.Количество()-3].Выгрузить();
	ТаблицаЗапасов = ПакетЗапросов[ПакетЗапросов.Количество()-2].Выгрузить();
	ТаблицаТоваров = ПакетЗапросов[ПакетЗапросов.Количество()-1].Выгрузить();
	
	Товары.Очистить();
	Марки.Очистить();
	
	Для Каждого ТекущаяСтрока Из ТаблицаТоваров Цикл
		
		ОтборСтрок = Новый Структура;
		ОтборСтрок.Вставить("Номенклатура", ТекущаяСтрока.Номенклатура);
		
		Количество            = ТекущаяСтрока.Количество;
		СуммаРозничная        = ТекущаяСтрока.СуммаРозничная;
		КоличествоПоНакладной = ТекущаяСтрока.КоличествоПоНакладной;
		
		ПерваяСтрока = Истина;
		
		СоответствиеАП = Сопоставление.НайтиСтроки(ОтборСтрок);
		Для Каждого СтрокаСоответствия Из СоответствиеАП Цикл
			
			Если Количество = 0 Тогда
				Прервать;
			КонецЕсли;
			
			ОтборСтрок = Новый Структура;
			ОтборСтрок.Вставить("АлкогольнаяПродукция", СтрокаСоответствия.АлкогольнаяПродукция);
			
			НайденныеЗапасы = ТаблицаЗапасов.НайтиСтроки(ОтборСтрок);
			Для Каждого СтрокаЗапаса Из НайденныеЗапасы Цикл
				
				Если Количество = 0 Тогда
					Прервать;
				КонецЕсли;
				
				ТекущееКоличество = Мин(Количество, СтрокаЗапаса.Количество);
				
				Если ТекущееКоличество = 0 Тогда
					Продолжить;
				КонецЕсли;
				
				КоличествоПоНакладнойВСтроке = ТекущееКоличество/ТекущаяСтрока.КоличествоВМультипаке;
				
				НоваяСтрока = Товары.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекущаяСтрока);
				Документы.АктСписанияЕГАИС.ТоварыНоменклатураПриИзменении(ЭтотОбъект, НоваяСтрока);
				
				НоваяСтрока.АлкогольнаяПродукция = СтрокаЗапаса.АлкогольнаяПродукция;
				НоваяСтрока.Справка2             = СтрокаЗапаса.Справка2;
				НоваяСтрока.ИдентификаторСтроки  = Новый УникальныйИдентификатор;
				Документы.АктСписанияЕГАИС.ТоварыАлкогольнаяПродукцияПриИзменении(ЭтотОбъект, НоваяСтрока);
				
				НоваяСтрока.Количество            = ТекущееКоличество;
				//НоваяСтрока.КоличествоПоНакладной = ?(НоваяСтрока.Коэффициент=0, КоличествоПоНакладнойВСтроке, Окр(КоличествоПоНакладнойВСтроке/НоваяСтрока.Коэффициент, 3));
				НоваяСтрока.КоличествоПоНакладной = КоличествоПоНакладнойВСтроке;
				НоваяСтрока.СуммаРозничная = ?(КоличествоПоНакладной = КоличествоПоНакладнойВСтроке, СуммаРозничная, Окр((СуммаРозничная/КоличествоПоНакладной)*КоличествоПоНакладнойВСтроке, 2));
				Документы.АктСписанияЕГАИС.ТоварыСуммаРозничнаяПриИзменении(ЭтотОбъект, НоваяСтрока);
				
				СуммаРозничная        = СуммаРозничная - НоваяСтрока.СуммаРозничная;
				Количество            = Количество - ТекущееКоличество;
				КоличествоПоНакладной = КоличествоПоНакладной - КоличествоПоНакладнойВСтроке;
				
				ТекущаяСтрока.КоличествоПоНакладной = ТекущаяСтрока.КоличествоПоНакладной - КоличествоПоНакладнойВСтроке;
				ТекущаяСтрока.Количество = ТекущаяСтрока.Количество - ТекущееКоличество;
				СтрокаЗапаса.Количество  = СтрокаЗапаса.Количество - ТекущееКоличество;
				
				Если СтрокаЗапаса.Количество = 0 Тогда
					ТаблицаЗапасов.Удалить(СтрокаЗапаса);
				КонецЕсли;
				
			КонецЦикла;
			
		КонецЦикла;
		
		Если Количество>0 Тогда
			НоваяСтрока = Товары.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекущаяСтрока);
			НоваяСтрока.ИдентификаторСтроки  = Новый УникальныйИдентификатор;
			НоваяСтрока.Количество     = Количество;
			//НоваяСтрока.КоличествоПоНакладной = ?(НоваяСтрока.Коэффициент=0, КоличествоПоНакладной, Окр(КоличествоПоНакладной/НоваяСтрока.Коэффициент, 3));
			НоваяСтрока.КоличествоПоНакладной = КоличествоПоНакладной;
			НоваяСтрока.СуммаРозничная = СуммаРозничная;
			Документы.АктСписанияЕГАИС.ТоварыСуммаРозничнаяПриИзменении(ЭтотОбъект, НоваяСтрока);
		КонецЕсли;
		
	КонецЦикла;
	
	// Возвращаем признак возможности дальнейшей обработки события
	Возврат ИСТИНА;
	
КонецФункции // ОбработкаЗаполнения_СписаниеТоваров()

// Производит заполнение объекта на основании документа "Инвентаризация алкогольной продукции ЕГАИС"
//
// Параметры:
//  ДанныеЗаполнения     - Произвольный - Значение, которое используется как основание для заполнения.
//  ТекстЗаполнения      - Строка       - Текст, используемый для заполнения объекта.
//  СтандартнаяОбработка - Булево       - В данный параметр передается признак выполнения системной обработки события.
//
Функция ОбработкаЗаполнения_ИнвентаризацияАлкогольнойПродукцииЕГАИС(ДанныеЗаполнения, ТекстЗаполнения="", СтандартнаяОбработка=ИСТИНА) Экспорт
	
	// Если данные заполнения не указаны, значит производиться проверка существования обработчика заполнения у объекта.
	Если НЕ ЗначениеЗаполнено(ДанныеЗаполнения) Тогда
		Возврат ИСТИНА;
	КонецЕсли;
	
	// Вызываем общий обработчик заполнения
	Если НЕ ОбработкаСобытийДокументаСервер.ОбработкаЗаполненияНаОсновании(ЭтотОбъект, ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка) Тогда
		Возврат ИСТИНА;
	КонецЕсли;
	
	Товары.Очистить();
	Марки.Очистить();
		
	Если ХозОперация = Справочники.ХозОперации.АктСписанияСТорговогоЗалаЕГАИС Тогда
		
		ЗаполнитьАктСписанияПоИнвентаризации(ДанныеЗаполнения);
		
	Иначе
		
		ХозОперация = Справочники.ХозОперации.АктСписанияЕГАИС;
		ПричинаСписания = Перечисления.ПричиныСписанияЕГАИС.Недостача;
		
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("ОрганизацияЕГАИС", ОрганизацияЕГАИС);
		Запрос.УстановитьПараметр("Ссылка",           ДанныеЗаполнения);
		Запрос.УстановитьПараметр("Момент",           ТекущаяДата());
		
		Запрос.Текст = "
		|ВЫБРАТЬ
		|	ИнвентаризацияТовары.АлкогольнаяПродукция КАК АлкогольнаяПродукция,
		|	ИнвентаризацияТовары.Справка2 КАК Справка2,
		|	ИнвентаризацияМарки.КодМарки КАК КодМарки
		|ПОМЕСТИТЬ
		|	ФактическиеМарки
		|ИЗ
		|	Документ.ИнвентаризацияАлкогольнойПродукцииЕГАИС.Товары КАК ИнвентаризацияТовары
		|ВНУТРЕННЕЕ СОЕДИНЕНИЕ
		|	Документ.ИнвентаризацияАлкогольнойПродукцииЕГАИС.Марки КАК ИнвентаризацияМарки
		|ПО
		|	ИнвентаризацияМарки.Ссылка = &Ссылка И 
		|	(НЕ ИнвентаризацияТовары.Справка2 = Значение(Справочник.Справки2ЕГАИС.ПустаяСсылка)) И 
		|	(НЕ ИнвентаризацияМарки.КодМарки = """") И 
		|	ИнвентаризацияТовары.ИдентификаторСтроки = ИнвентаризацияМарки.ИдентификаторСтроки 
		|ГДЕ
		|	ИнвентаризацияТовары.Ссылка = &Ссылка
		//|	ИнвентаризацияТовары.Справка2.ПоштучныйУчет = ИСТИНА
		|;
		|
		|ВЫБРАТЬ
		|	ТаблицаМарок.АлкогольнаяПродукция КАК АлкогольнаяПродукция,
		|	ТаблицаМарок.Справка2 КАК Справка2,
		|	КОЛИЧЕСТВО(ТаблицаМарок.КодМарки) КАК Количество
		|ПОМЕСТИТЬ
		|	ТаблицаМарок
		|ИЗ
		|	ФактическиеМарки КАК ТаблицаМарок
		|СГРУППИРОВАТЬ ПО
		|	ТаблицаМарок.АлкогольнаяПродукция,
		|	ТаблицаМарок.Справка2
		|;
		|
		|ВЫБРАТЬ
		|	ИнвентаризацияТовары.Номенклатура КАК Номенклатура,
		|	ИнвентаризацияТовары.АлкогольнаяПродукция КАК АлкогольнаяПродукция,
		//|	ИнвентаризацияТовары.ЕдиницаИзмерения,
		//|	ИнвентаризацияТовары.Коэффициент,
		|	ИнвентаризацияТовары.ХарактеристикаНоменклатуры,
		|	СУММА(ИнвентаризацияТовары.КоличествоКнижн) КАК КоличествоКнижн
		|ПОМЕСТИТЬ
		|	ТаблицаТоваров
		|ИЗ
		|	Документ.ИнвентаризацияАлкогольнойПродукцииЕГАИС.Товары КАК ИнвентаризацияТовары
		|ГДЕ
		|	ИнвентаризацияТовары.Ссылка = &Ссылка
		//|	ИнвентаризацияТовары.Справка2.ПоштучныйУчет = ИСТИНА
		|СГРУППИРОВАТЬ ПО
		|	ИнвентаризацияТовары.Номенклатура,
		|	ИнвентаризацияТовары.АлкогольнаяПродукция,
		//|	ИнвентаризацияТовары.ЕдиницаИзмерения,
		//|	ИнвентаризацияТовары.Коэффициент,
		|	ИнвентаризацияТовары.ХарактеристикаНоменклатуры
		|ИМЕЮЩИЕ
		|	СУММА(ИнвентаризацияТовары.КоличествоКнижн)>0
		|;
		|
		|ВЫБРАТЬ
		|	&ОрганизацияЕГАИС КАК ОрганизацияЕГАИС,
		|	ИнвентаризацияТовары.Номенклатура КАК Номенклатура,
		|	ИнвентаризацияТовары.АлкогольнаяПродукция КАК АлкогольнаяПродукция,
		//|	ИнвентаризацияТовары.ЕдиницаИзмерения,
		//|	ИнвентаризацияТовары.Коэффициент,
		|	ИнвентаризацияТовары.ХарактеристикаНоменклатуры,
		|	МАКСИМУМ(ИнвентаризацияТовары.КоличествоКнижн) - ЕСТЬNULL(СУММА(ИнвентаризацияМарки.Количество), 0) КАК Количество
		|ПОМЕСТИТЬ
		|	ТаблицаТоваровДляСписания
		|ИЗ
		|	ТаблицаТоваров КАК ИнвентаризацияТовары
		|ЛЕВОЕ СОЕДИНЕНИЕ
		|	ТаблицаМарок КАК ИнвентаризацияМарки
		|ПО
		|	ИнвентаризацияТовары.АлкогольнаяПродукция = ИнвентаризацияМарки.АлкогольнаяПродукция
		|СГРУППИРОВАТЬ ПО
		|	ИнвентаризацияТовары.Номенклатура,
		|	ИнвентаризацияТовары.АлкогольнаяПродукция,
		//|	ИнвентаризацияТовары.ЕдиницаИзмерения,
		//|	ИнвентаризацияТовары.Коэффициент,
		|	ИнвентаризацияТовары.ХарактеристикаНоменклатуры
		|ИМЕЮЩИЕ
		|	МАКСИМУМ(ИнвентаризацияТовары.КоличествоКнижн) > ЕСТЬNULL(СУММА(ИнвентаризацияМарки.Количество), 0)
		|;
		|
		|УНИЧТОЖИТЬ
		|	ТаблицаТоваров
		|;
		|
		|ВЫБРАТЬ
		|	ТаблицаТоваров.Номенклатура КАК Номенклатура,
		|	ТаблицаТоваров.АлкогольнаяПродукция КАК АлкогольнаяПродукция,
		//|	ТаблицаТоваров.ЕдиницаИзмерения,
		//|	ТаблицаТоваров.Коэффициент,
		|	ТаблицаТоваров.ХарактеристикаНоменклатуры,
		|	ОстаткиАлкогольнойПродукцииЕГАИС.АлкогольнаяПродукция,
		|	ОстаткиАлкогольнойПродукцииЕГАИС.Справка2,
		|	ОстаткиАлкогольнойПродукцииЕГАИС.КоличествоОстаток КАК Количество
		|ПОМЕСТИТЬ
		|	ТаблицаТоваров
		|ИЗ
		|	ТаблицаТоваровДляСписания КАК ТаблицаТоваров
		|ВНУТРЕННЕЕ СОЕДИНЕНИЕ
		|	РегистрНакопления.ОстаткиАлкогольнойПродукцииЕГАИС.Остатки(&Момент, (НЕ Справка2 = ЗНАЧЕНИЕ(Справочник.Справки2Егаис.ПустаяСсылка)) И (АлкогольнаяПродукция, ОрганизацияЕГАИС) В (ВЫБРАТЬ АлкогольнаяПродукция, ОрганизацияЕГАИС ИЗ ТаблицаТоваровДляСписания)) КАК ОстаткиАлкогольнойПродукцииЕГАИС
		|ПО
		|	ТаблицаТоваров.АлкогольнаяПродукция = ОстаткиАлкогольнойПродукцииЕГАИС.АлкогольнаяПродукция
		|;
		|
		|ВЫБРАТЬ
		|	ТаблицаТоваров.Номенклатура КАК Номенклатура,
		|	ТаблицаТоваров.АлкогольнаяПродукция КАК АлкогольнаяПродукция,
		//|	ТаблицаТоваров.ЕдиницаИзмерения,
		//|	ТаблицаТоваров.Коэффициент,
		|	ТаблицаТоваров.ХарактеристикаНоменклатуры,
		|	ТаблицаТоваров.Справка2,
		|	ТаблицаТоваров.Количество - ЕСТЬNULL(ТаблицаМарок.Количество, 0) КАК Количество
		|ПОМЕСТИТЬ
		|	ТаблицаТоваровКСписанию
		|ИЗ
		|	ТаблицаТоваров КАК ТаблицаТоваров
		|ЛЕВОЕ СОЕДИНЕНИЕ
		|	ТаблицаМарок КАК ТаблицаМарок
		|ПО
		|	ТаблицаТоваров.АлкогольнаяПродукция = ТаблицаМарок.АлкогольнаяПродукция И 
		|	ТаблицаТоваров.Справка2        = ТаблицаМарок.Справка2
		|ГДЕ
		|	ТаблицаТоваров.Количество > ЕСТЬNULL(ТаблицаМарок.Количество, 0)
		|;
		|
		|ВЫБРАТЬ
		|	ОстаткиМарокЕГАИС.Справка2 КАК Справка2,
		|	ОстаткиМарокЕГАИС.КодМарки
		|ПОМЕСТИТЬ
		|	КнижныеМаркиБезФакта
		|ИЗ
		|	РегистрНакопления.ОстаткиМарокЕГАИС.Остатки(&Момент, ОрганизацияЕГАИС = &ОрганизацияЕГАИС И Справка2 В (ВЫБРАТЬ Справка2 ИЗ ТаблицаТоваровКСписанию)) КАК ОстаткиМарокЕГАИС
		|ЛЕВОЕ СОЕДИНЕНИЕ
		|	ФактическиеМарки КАК ИнвентаризацияМарки
		|ПО
		|	ИнвентаризацияМарки.КодМарки = ОстаткиМарокЕГАИС.КодМарки
		|ГДЕ
		|	ИнвентаризацияМарки.КодМарки ЕСТЬ NULL
		|;
		|
		|ВЫБРАТЬ
		|	ТаблицаТоваров.Номенклатура КАК Номенклатура,
		|	ТаблицаТоваров.АлкогольнаяПродукция КАК АлкогольнаяПродукция,
		//|	ТаблицаТоваров.ЕдиницаИзмерения,
		//|	ТаблицаТоваров.Коэффициент,
		|	ТаблицаТоваров.ХарактеристикаНоменклатуры,
		|	ТаблицаТоваров.Справка2,
		|	ТаблицаТоваров.Количество КАК Количество,
		|	ЕСТЬNULL(КнижныеМаркиБезФакта.КодМарки, """") КАК КодМарки
		|ИЗ
		|	ТаблицаТоваровКСписанию КАК ТаблицаТоваров
		|ЛЕВОЕ СОЕДИНЕНИЕ
		|	КнижныеМаркиБезФакта КАК КнижныеМаркиБезФакта
		|ПО
		|	ТаблицаТоваров.Справка2 = КнижныеМаркиБезФакта.Справка2
		|ИТОГИ
		|	МАКСИМУМ(Номенклатура),
		|	МАКСИМУМ(АлкогольнаяПродукция),
		//|	МАКСИМУМ(ЕдиницаИзмерения),
		//|	МАКСИМУМ(Коэффициент),
		|	МАКСИМУМ(ХарактеристикаНоменклатуры),
		|	МАКСИМУМ(Количество)
		|ПО
		|	ТаблицаТоваров.Справка2
		|";
		
		ВыборкаПоСправкеБ = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
		СчетчикСтрок = 1;
		Пока ВыборкаПоСправкеБ.Следующий() Цикл
			МаксимальноеКоличество = ВыборкаПоСправкеБ.Количество;
			Если МаксимальноеКоличество = 0 Тогда
				Продолжить;
			КонецЕсли;
			
			НоваяСтрока = Товары.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ВыборкаПоСправкеБ);
			НоваяСтрока.ИдентификаторСтроки = СчетчикСтрок;
			
			Выборка = ВыборкаПоСправкеБ.Выбрать();
			Пока Выборка.Следующий() Цикл
				Если МаксимальноеКоличество = 0 Тогда
					Прервать;
				КонецЕсли;
				Если Выборка.КодМарки = "" Тогда
					Продолжить;
				КонецЕсли;
				НоваяСтрокаМарки = Марки.Добавить();
				НоваяСтрокаМарки.КодМарки           = Выборка.КодМарки;
				НоваяСтрокаМарки.ИдентификаторСтроки = СчетчикСтрок;
				МаксимальноеКоличество = МаксимальноеКоличество - 1;
			КонецЦикла;
			
			СчетчикСтрок = СчетчикСтрок + 1;
			
		КонецЦикла;
		
	КонецЕсли;
	
	// Возвращаем признак возможности дальнейшей обработки события
	Возврат ИСТИНА;
	
КонецФункции // ОбработкаЗаполнения_ПоступлениеТоваров()


////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ФОРМИРОВАНИЯ ДВИЖЕНИЙ


////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ОБЪЕКТА

// Обработчик события заполнения объекта как при создании нового, так и при вводе на основании существующего.
//
// Параметры:
//  ДанныеЗаполнения     - Произвольный - Значение, которое используется как основание для заполнения.
//  ТекстЗаполнения      - Строка       - Текст, используемый для заполнения объекта.
//  СтандартнаяОбработка - Булево       - В данный параметр передается признак выполнения системной обработки события.
//
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("Структура") И ДанныеЗаполнения.Свойство("ДокументЗаполнения") Тогда
		// Вызываем общий обработчик события
		Если ДанныеЗаполнения.Свойство("ХозОперация") Тогда
			ХозОперация = ДанныеЗаполнения.ХозОперация;
		КонецЕсли;
		Если НЕ ОбработкаСобытийДокументаСервер.ОбработкаЗаполнения(ЭтотОбъект, ДанныеЗаполнения.ДокументЗаполнения, ТекстЗаполнения, СтандартнаяОбработка) Тогда
			Возврат;
		КонецЕсли;
	Иначе
		// Вызываем общий обработчик события
		Если НЕ ОбработкаСобытийДокументаСервер.ОбработкаЗаполнения(ЭтотОбъект, ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка) Тогда
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	ИнтеграцияЕГАИС.ОбработкаЗаполненияПоУмолчанию(ЭтотОбъект);
	
КонецПроцедуры // ОбработкаЗаполнения()

// Обработчик события заполнения объекта копированием.
//
// Параметры:
//  ОбъектКопирования - ДокументОбъект - Исходный объект, который является источником копирования.
//
Процедура ПриКопировании(ОбъектКопирования)
	
	// Вызываем общий обработчик события
	Если НЕ ОбработкаСобытийДокументаСервер.ПриКопировании(ЭтотОбъект, ОбъектКопирования) Тогда
		Возврат;
	КонецЕсли;
	
	ИнтеграцияЕГАИС.ОбработкаЗаполненияПоУмолчанию(ЭтотОбъект);
	Марки.Очистить();
	
КонецПроцедуры // ПриКопировании()

// Обработчик события возникающего при необходимости проверки заполнения реквизитов при записи или при проведении.
//
// Параметры:
//  Отказ                - Булево - Признак отказа от продолжения работы после выполнения проверки заполнения.
//  ПроверяемыеРеквизиты - Массив - Массив путей к реквизитам, для которых будет выполнена проверка заполнения.
//
Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	// Вызываем общий обработчик события
	Если НЕ ОбработкаСобытийДокументаСервер.ОбработкаПроверкиЗаполнения(ЭтотОбъект, Отказ, ПроверяемыеРеквизиты) Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры // ОбработкаПроверкиЗаполнения()

// Обработчик события возникающего после начала транзакции записи, но до начала записи объекта.
//
// Параметры:
//  Отказ           - Булево                   - Признак отказа от совершения операции.
//  РежимЗаписи     - РежимЗаписиДокумента     - Текущий режим записи документа.
//  РежимПроведения - РежимПроведенияДокумента - Текущий режим проведения.
//
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	// Вызываем общий обработчик события
	Если НЕ ОбработкаСобытийДокументаСервер.ПередЗаписью(ЭтотОбъект, Отказ, РежимЗаписи, РежимПроведения) Тогда
		Возврат;
	КонецЕсли;
	
	ИнтеграцияЕГАИС.ЗаписатьСоответствиеНоменклатуры(Товары,, Ложь);
	
	Если ПустаяСтрока(Идентификатор) Тогда
		Идентификатор = СокрЛП(Новый УникальныйИдентификатор);
	КонецЕсли;
	
	Для Каждого ТекущаяСтрока Из Товары Цикл
		//Если ТекущаяСтрока.Коэффициент = 0 Тогда
		//	ТекущаяСтрока.Коэффициент = 1;
		//КонецЕсли;
		
		Если ПустаяСтрока(ТекущаяСтрока.ИдентификаторСтроки) Тогда
			ТекущаяСтрока.ИдентификаторСтроки  = Новый УникальныйИдентификатор;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры // ПередЗаписью()

// Обработчик события возникающего после записи объекта в базу данных, но до окончания транзакции записи.
//
// Параметры:
//  Отказ - Булево - Признак отказа от совершения операции.
//
Процедура ПриЗаписи(Отказ)
	
	// Вызываем общий обработчик события
	Если НЕ ОбработкаСобытийДокументаСервер.ПриЗаписи(ЭтотОбъект, Отказ) Тогда
		Возврат;
	КонецЕсли;
	
	ИнтеграцияЕГАИС.ЗаписатьСтатусДокументаЕГАИСПоУмолчанию(ЭтотОбъект);
	
	Если ПолучитьЗначениеПараметраСтруктуры(ДополнительныеСвойства, "ЭтоНовый", Ложь) Тогда
		Для Каждого ТекущаяСтрока Из Смены Цикл
			ДанныеЗаписи = РегистрыСведений.СтатусыДокументовЕГАИС.ЗначенияПоУмолчанию(ТекущаяСтрока.Смена);
			РегистрыСведений.СтатусыДокументовЕГАИС.ВыполнитьЗаписьВРегистр(ДанныеЗаписи);
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры // ПриЗаписи()

// Обработчик события возникающего в транзакции удаления перед непосредственным удалением объекта из базы данных.
//
// Параметры:
//  Отказ - Булево - Признак отказа от совершения операции.
//
Процедура ПередУдалением(Отказ)
	
	// Вызываем общий обработчик события
	Если НЕ ОбработкаСобытийДокументаСервер.ПередУдалением(ЭтотОбъект, Отказ) Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры // ПередУдалением()

// Обработчик события возникающего при отмене проведения документа. Выполняется в транзакции записи.
//
// Параметры:
//  Отказ - Булево - Признак отказа от совершения операции.
//
Процедура ОбработкаУдаленияПроведения(Отказ)
	
	// Вызываем общий обработчик события
	Если НЕ ОбработкаСобытийДокументаСервер.ОбработкаУдаленияПроведения(ЭтотОбъект, Отказ) Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры // ОбработкаУдаленияПроведения()

// Обработчик события возникающего в транзакции записи для формирования движений документу по подчиненным регистрам.
//
// Параметры:
//  Отказ           - Булево                   - Признак отказа от совершения операции.
//  РежимПроведения - РежимПроведенияДокумента - Текущий режим проведения.
//
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	// Вызываем общий обработчик события
	Если НЕ ОбработкаСобытийДокументаСервер.ОбработкаПроведения(ЭтотОбъект, Отказ, РежимПроведения) Тогда
		Возврат;
	КонецЕсли;
	
	// Инициализация дополнительных свойств для проведения документа
	ПроведениеСервер.ИнициализироватьДополнительныеСвойстваДляПроведения(Ссылка, ДополнительныеСвойства, РежимПроведения);
	
	// Инициализация данных документа
	Документы.АктСписанияЕГАИС.ИнициализироватьДанныеДокумента(Ссылка, ДополнительныеСвойства);
	
	// Подготовка наборов записей
	ПроведениеСервер.ПодготовитьНаборыЗаписейКРегистрацииДвижений(ЭтотОбъект);
	
	РегистрыНакопления.ОстаткиАлкогольнойПродукцииЕГАИС.ЗаписатьТаблицуДвижений(ДополнительныеСвойства.ТаблицыДляДвижений.ОстаткиАлкогольнойПродукцииЕГАИС, Движения, Отказ);
	РегистрыНакопления.ОстаткиМарокЕГАИС.ЗаписатьТаблицуДвижений(ДополнительныеСвойства.ТаблицыДляДвижений.ОстаткиМарокЕГАИС, Движения, Отказ);
	
	ПроведениеСервер.ЗаписатьНаборыЗаписей(ЭтотОбъект);
	ПроведениеСервер.ОчиститьДополнительныеСвойстваДляПроведения(ДополнительныеСвойства);
	
КонецПроцедуры // ОбработкаПроведения()


#КонецЕсли
